app/Controllers/Client/ChambreController.php

    public function index()
    {
        $chambreModel = new ChambreModel();
        $imageModel = new ImageModel();

        $chambres = $chambreModel->getDisponibleChambre();

        foreach ($chambres as &$chambre) {
            $chambre['images'] = $imageModel
                ->where('chambre_id', $chambre['id']) // Remplacez 'id' par le nom correct de la colonne de clé primaire
                ->findAll();
---
SELECT *
FROM `images`
WHERE `chambre_id` = '1'