app/Controllers/Client/ClientController.php

SELECT *
FROM `clients`
WHERE `user_id` = '12'
 LIMIT 1
---
    public function profile()
    {
        $clientModel = new ClientModel();
        $client = $clientModel->where('user_id', session()->get('user_id'))->first();