app/Controllers/Client/PaymentController.php

    public function success()
    {
        $reservationModel = new ReservationModel();
        $paiementModel = new PaiementModel();
        $chambreModel=new ChambreModel();

        $reservationData = [
            'client_id' => session()->get('user_id'),
            'chambre_id' => session()->get('chambre_id'),
            'date_debut' => session()->get('date_debut'),
            'date_fin' => session()->get('date_fin'),
            'statut' => 'confirmée',
        ];

        if ($reservationModel->save($reservationData)) {
            $chambreModel->update(session()->get('chambre_id'), ['statut' => 'occupe']);
            $reservation_id = $reservationModel->getInsertID();
            $paiementData = [
                'reservation_id' => $reservation_id,
                'montant' => session()->get('montant_total'),
                'methode' => 'card',
                'date'=>session()->get('date_debut'),
                'statut' => 'effectue',
            ];

            $paiementModel->save($paiementData);
---
INSERT INTO `reservations` (`client_id`, `chambre_id`, `date_debut`, `date_fin`, `statut`) VALUES ('16', '5', '2024-12-06', '2024-12-08', 'confirmée')
INSERT INTO `paiements` (`reservation_id`, `montant`, `methode`, `date`, `statut`) VALUES (19, 400, 'card', '2024-12-06', 'effectue')