app/Controllers/Admin/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `chambres`
SELECT COUNT(*) AS `numrows`
FROM `chambres`
WHERE `statut` = 'disponible'
SELECT COUNT(*) AS `numrows`
FROM `reservations`
SELECT COUNT(*) AS `numrows`
FROM `clients`
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `statut` != 'terminée'
---
        public function dashboard(){


        $months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'];
        $reservationData = $this->getMonthlyReservationData();
        $data = [
            'months' => $months,
            'reservationData' => $reservationData,
            'totalChambres' => $this->chambreModel->countAllResults(),
            'disponibleChambres'=>$this->chambreModel->where('statut' ,'disponible')->countAllResults(),
            'totalReservations' => $this->reservationModel->countAllResults(),
            'totalClients' => $this->clientModel->countAllResults(),
            'activeReservations' => $this->reservationModel->where('statut !=','terminée')->countAllResults(),

SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE MONTH(date_debut) = 1
---
        private function getMonthlyReservationData()
        {
            $data = [];
            for ($i = 1; $i <= 12; $i++) {
                $data[] = $this->reservationModel
                    ->where('MONTH(date_debut)', $i)
                    ->countAllResults();