app/Controllers/Admin/AdminController.php

SELECT *
FROM `reservations`
ORDER BY `created_at` DESC
 LIMIT 5
---
        public function dashboard(){

        $chambreModel = new ChambreModel();
        $reservationModel = new ReservationModel();
        $clientModel = new ClientModel();

        $data = [
            'totalChambres' => $chambreModel->countAll(),
            'totalReservations' => $reservationModel->countAll(),
            'totalClients' => $clientModel->countAll(),
            'reservationsRecents' => $reservationModel->orderBy('created_at', 'desc')->findAll(5),
        ];