app/Controllers/Admin/ChambreController.php

DELETE FROM `chambres`
WHERE `id` IN ('5')
---
    public function delete($id)
    {
        $chambreModel = new ChambreModel();
        $chambreModel->delete($id);