app/Controllers/Admin/ChambreController.php

SELECT *
FROM `type_chambre`
---
    public function create()
    {
        $typeChambreModel = new ChambreTypeModel();
        $data['types_chambre'] = $typeChambreModel->findAll();

INSERT INTO `chambres` (`numero`, `prix`, `description`, `statut`, `type_chambre_id`) VALUES ('3', '54', 'sd', 'disponible', '1')
---
    public function store()
    {


        $rules = [
            'numero' => 'required|integer',
            'prix' => 'required|decimal',
            'description' => 'permit_empty|string',
            'statut' => 'required|in_list[disponible,occupe]',
            'type_chambre_id' => 'required|integer'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }


        if (($this->request->getMethod() === 'POST')) {
            $chambreModel = new ChambreModel();
            $data = [
                'numero' => $this->request->getPost('numero'),
                'prix' => $this->request->getPost('prix'),
                'description' => $this->request->getPost('description'),
                'statut' => $this->request->getPost('statut'),
                'type_chambre_id' => $this->request->getPost('type_chambre_id'),
            ];

            $chambreModel->save($data);

DELETE FROM `chambres`
WHERE `id` IN ('26')
---
    public function delete($id)
    {
        $chambreModel = new ChambreModel();
        $imageModel =new ImageModel();
        $chambreModel->delete($id);
        $imageModel->deleteImagesByChambreId($id);

INSERT INTO `images` (`chambre_id`, `image_path`, `created_at`, `updated_at`) VALUES (26, 'uploads/chambres/1732046934_fddd34827f0132adb1ac.jpg', '2024-11-19 20:08:54', '2024-11-19 20:08:54')
---
    public function uploadImages($chambreId)
{
    $files = $this->request->getFiles();
    foreach ($files['images'] as $file) {
        if ($file->isValid()) {
            $newName = $file->getRandomName();
            $file->move('uploads/chambres', $newName);

            $db = \Config\Database::connect();
            $builder = $db->table('images');
            $builder->insert([
                'chambre_id' => $chambreId,
                'image_path' => 'uploads/chambres/' . $newName,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s'),
            ]);