app/Controllers/Admin/ClientController.php

    public function index()
    {
        $clients = $this->clientModel->findAll();
---
SELECT *
FROM `clients`

    public function store()
    {

        $data = $this->request->getPost();

        $rules = [
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'password_confirm' => 'required|min_length[6]|matches[password]',
            'nom' => 'required|min_length[2]',
            'prenom' => 'required|min_length[2]',
            'telephone' => 'required|min_length[10]|max_length[15]',
            'adresse' => 'required|min_length[5]',
        ];

        if (!$this->validate($rules)) {
            $data['validation'] = $this->validator;
            return view('admin/clients/create', $data);
        }


        if ($this->usermodel->save([
            'email' => $data['email'],
            'password' => password_hash($data['password'], PASSWORD_DEFAULT),
            'role' => 'client',
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s')
        ])) {
---
INSERT INTO `users` (`email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('alaahanani@gmail.com', '$2y$10$qm7t0vhJF0hQpfCvRj6AZ.SQk8kMq1IYAfqgisx0aqgTLbOiSzhq.', 'client', '2024-11-14 21:13:51', '2024-11-14 21:13:51')

                return redirect()->back()->with('error', 'Erreur lors de l\'insertion dans la table users. ID non récupéré');
            }

            if ($this->clientModel->insert([
                'user_id' => $user_id,
                'nom' => $this->request->getPost('nom'),
                'prenom' => $this->request->getPost('prenom'),
                'telephone' => $this->request->getPost('telephone'),
                'adresse' => $this->request->getPost('adresse'),
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ])) {
---
INSERT INTO `clients` (`user_id`, `nom`, `prenom`, `telephone`, `adresse`, `created_at`, `updated_at`) VALUES (17, 'hanani', 'alaa', '0631983072', 'rouan france', '2024-11-14 21:13:51', '2024-11-14 21:13:51')

    public function update($clientId)
    {
        $this->clientModel->update($clientId, [
            'nom' => $this->request->getPost('nom'),
            'prenom' => $this->request->getPost('prenom'),
            'telephone' => $this->request->getPost('telephone'),
            'adresse' => $this->request->getPost('adresse'),
        ]);
---
UPDATE `clients` SET `nom` = 'oubihi', `prenom` = 'fadma', `telephone` = '0680625819', `adresse` = 'hey bouaalaga biogura', `updated_at` = '2024-11-14 21:13:09'
WHERE `clients`.`user_id` IN ('8')

    public function delete($clientId)
    {
        $this->clientModel->delete($clientId);
        $this->usermodel->delete($clientId);
---
DELETE FROM `clients`
WHERE `user_id` IN ('9')
DELETE FROM `users`
WHERE `id` IN ('9')