app/Controllers/Admin/PaiementController.php

    public function index()
    {
        $paiementModel = new PaiementModel();

        // Récupérer les filtres depuis la requête GET
        $filters = [
            'reservation_id' => $this->request->getGet('reservation_id'),
            'methode' => $this->request->getGet('methode'),
            'statut' => $this->request->getGet('statut'),
        ];

        // Appliquer les filtres au modèle
        $query = $paiementModel;
        if (!empty($filters['reservation_id'])) {
            $query = $query->where('reservation_id', $filters['reservation_id']);
        }
        if (!empty($filters['methode'])) {
            $query = $query->where('methode', $filters['methode']);
        }
        if (!empty($filters['statut'])) {
            $query = $query->where('statut', $filters['statut']);
        }

        // Récupérer les paiements filtrés
        $data['paiements'] = $query->findAll();
---
SELECT *
FROM `paiements`

public function updateStatut($id)
{
    $paiementModel = new PaiementModel();
    $reservationModel = new ReservationModel();

    // Vérifier si le paiement existe
    $paiement = $paiementModel->find($id);
    if (!$paiement) {
        return redirect()->to('/admin/paiements')->with('error', 'Paiement introuvable');
    }

    // Récupérer le statut depuis le formulaire
    $statutPaiement = $this->request->getPost('statut');

    // Mettre à jour uniquement le statut du paiement
    $paiementModel->update($id, ['statut' => $statutPaiement]);

    // Définir le statut de la réservation en fonction du statut du paiement
    $statutReservation = 'en attente'; // Par défaut
    if ($statutPaiement === 'effectue') {
        $statutReservation = 'confirmée';
    } elseif ($statutPaiement === 'echoue') {
        $statutReservation = 'annulée';
    }

    // Mettre à jour le statut de la réservation correspondante
    $reservationModel->update($paiement['reservation_id'], ['statut' => $statutReservation]);
---
SELECT *
FROM `paiements`
WHERE `paiements`.`id` = '3'
UPDATE `paiements` SET `statut` = 'effectue'
WHERE `paiements`.`id` IN ('3')
UPDATE `reservations` SET `statut` = 'confirmée'
WHERE `reservations`.`id` IN ('12')