app/Controllers/Admin/RapportController.php

    public function index()
    {
        $reservationModel = new ReservationModel();
        $reservations = $reservationModel->select('MONTH(created_at) as month, COUNT(*) as total')
                                         ->groupBy('MONTH(created_at)')
                                         ->findAll();

        $paiementModel = new PaiementModel();
        $chiffreAffaires = $paiementModel->selectSum('montant')->first();
        $paiementsMensuels = $paiementModel->select('MONTH(date) as month, SUM(montant) as total')
                                           ->groupBy('MONTH(date)')
                                           ->findAll();
---
SELECT MONTH(created_at) as month, COUNT(*) as total
FROM `reservations`
GROUP BY MONTH(created_at)
SELECT SUM(`montant`) AS `montant`
FROM `paiements`
 LIMIT 1
SELECT MONTH(date) as month, SUM(montant) as total
FROM `paiements`
GROUP BY MONTH(date)

    public function revenus()
    {
        $paiementModel = new PaiementModel();
        $mois = $this->request->getVar('mois') ?? date('m');
        $annee = $this->request->getVar('annee') ?? date('Y');

        $revenus = $paiementModel
            ->select('SUM(montant) as total')
            ->where('YEAR(date)', $annee)
            ->where('MONTH(date)', $mois)
            ->first();
---
SELECT SUM(montant) as total
FROM `paiements`
WHERE YEAR(date) = '2024'
AND MONTH(date) = '12'
 LIMIT 1

   public function chambresPopularite()
{
    $reservationModel = new ReservationModel();
    $data['statistiques'] = $reservationModel
        ->select('type_chambre.nom as type_chambre_nom, type_chambre.description as type_chambre_description, COUNT(*) as total')
        ->join('chambres', 'reservations.chambre_id = chambres.id')
        ->join('type_chambre', 'chambres.type_chambre_id = type_chambre.id')
        ->groupBy('type_chambre.id')
        ->orderBy('total', 'DESC')
        ->findAll();
---
SELECT `type_chambre`.`nom` as `type_chambre_nom`, `type_chambre`.`description` as `type_chambre_description`, COUNT(*) as total
FROM `reservations`
JOIN `chambres` ON `reservations`.`chambre_id` = `chambres`.`id`
JOIN `type_chambre` ON `chambres`.`type_chambre_id` = `type_chambre`.`id`
GROUP BY `type_chambre`.`id`
ORDER BY `total` DESC