app/Controllers/Admin/ReservationController.php

    public function index()
    {
        $reservations = $this->reservationModel->findAll();
        foreach ($reservations as &$reservation) {
            $reservation['client'] = $this->clientModel->find($reservation['client_id']);
            $reservation['chambre'] = $this->chambreModel->find($reservation['chambre_id']);
---
SELECT *
FROM `reservations`
SELECT *
FROM `chambres`
WHERE `chambres`.`id` = '7'

    public function create()
    {
        $data['clients'] = $this->clientModel->findAll();
        $data['chambres'] = $this->chambreModel->findAll();
---
SELECT *
FROM `clients`
SELECT *
FROM `chambres`

    public function store()
    {
        $this->reservationModel->insert([
            'client_id' => $this->request->getPost('client_id'),
            'chambre_id' => $this->request->getPost('chambre_id'),
            'date_debut' => $this->request->getPost('date_debut'),
            'date_fin' => $this->request->getPost('date_fin'),
        ]);
---
INSERT INTO `reservations` (`client_id`, `chambre_id`, `date_debut`, `date_fin`) VALUES ('2', '11', '2024-11-16', '2024-11-30')

    public function edit($id)
    {
        $data['reservation'] = $this->reservationModel->find($id);
        $data['clients'] = $this->clientModel->findAll();
        $data['chambres'] = $this->chambreModel->findAll();
---
SELECT *
FROM `reservations`
WHERE `reservations`.`id` = '3'
SELECT *
FROM `clients`
SELECT *
FROM `chambres`