app/Controllers/AuthController.php

    public function verify_login()
    {
        $data = [];
        $usermodel = new UserModel();

        // Validation des règles
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {

            $data['validation'] = $this->validator;
            return view('auth/login', $data);
        }
        $user = $usermodel->where('email', $this->request->getPost('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'zakaria@hanani.com'
 LIMIT 1