app/Models/ChambreModel.php

    public function getChambreById($id)
    {
        return $this->where('id', $id)->first();
---
SELECT *
FROM `chambres`
WHERE `id` = '1'
 LIMIT 1

    public function getDisponibleChambre(){
        return $this->select('chambres.*')
                    ->where('chambres.statut', 'disponible')
                    ->findAll();
---
SELECT `chambres`.*
FROM `chambres`
WHERE `chambres`.`statut` = 'disponible'

    public function getWithType($id = null)
    {
        if ($id) {
            return $this->select('chambres.*, type_chambre.nom as type_nom, type_chambre.description as type_description')
                        ->join('type_chambre', 'type_chambre.id = chambres.type_chambre_id')
                        ->where('chambres.id', $id)
                        ->first();
        } else {
            return $this->select('chambres.*, type_chambre.nom as type_nom, type_chambre.description as type_description')
                        ->join('type_chambre', 'type_chambre.id = chambres.type_chambre_id')
                        ->findAll();
---
SELECT *, `chambres`.*, `type_chambre`.`nom` as `type_nom`, `type_chambre`.`description` as `type_description`
FROM `chambres`
JOIN `type_chambre` ON `type_chambre`.`id` = `chambres`.`type_chambre_id`

    public function getImages($chambreId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('images');
        return $builder->where('chambre_id', $chambreId)->get()->getResultArray();
---
SELECT *
FROM `images`
WHERE `chambre_id` = '25'