app/Models/ImageModel.php

    public function deleteImagesByChambreId(int $chambreId): bool
    {
        return $this->where('chambre_id', $chambreId)->delete();
---
DELETE FROM `images`
WHERE `chambre_id` = 26