app/Models/ReservationModel.php

SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `client_id` = '2'
---
    public function countReservationsByClient($clientId)
{
    return $this->where('client_id', $clientId)->countAllResults();